[net]
batch=64
width=32
height=32

learning_rate=0.001

[convolutional]
filters=6
ksize=5
stride=1
pad=0

[pooling]
type=average
ksize=2

[convolutional]
filters=16
ksize=5
stride=1
pad=0

[pooling]
type=average
ksize=2

[convolutional]
filters=120
ksize=5
stride=1
pad=0