[net]
batch=64
subdivisions=16
width=32
height=32

learning_rate=0.001
max_batches=4000

[convolutional]
filters=6
size=5
stride=1
pad=0

[pooling]
type=average
size=2

[convolutional]
filters=16
size=5
stride=1
pad=0

[pooling]
type=average
size=2

[convolutional]
filters=120
size=5
stride=1
pad=0

[fullconnect]
size=84
activation=tanh